www/jvm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head><!-- <meta name="baidu-site-verification" content="707024a76f8f40b549f07f478abab237"/> -->
<title>jvm</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="jvm"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-29 12:21:23 CST"/>
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./css/site-plain.css" />

</head>
<body><!-- <div id="bdshare" class="bdshare_t bds_tools_32 get-codes-bdshare"><a class="bds_tsina"></a><span class="bds_more"></span><a class="shareCount"></a></div> --><!-- Place this tag where you want the +1 button to render --><g:plusone annotation="inline"></g:plusone>


<div id="content">
<h1 class="title">jvm</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 jvm</a>
<ul>
<li><a href="#sec-1-1">1.1 Spec</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 浮点运算</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 GC</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> jvm</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Spec</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 浮点运算</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>float类型数值常量后面加上F比如3.042F,而double类型数值常量后面加上D比如3.402D.所有浮点数值计算都遵循IEEE 752规范。java提供了三种表示溢出或者计算错误的三种特殊浮点数值：
</p><ol>
<li>正无穷大 Double.POSITIVE_INFINITY
</li>
<li>负无穷大 Double.NEGATIVE_INFINITY
</li>
<li>NaN(不是数字) Double.NaN. 浮点数/0的话就会得到NaN.判断是否为NaN不应该使用==因为和一个NaN比较始终都是false,而应该使用Double.isNaN(x)
</li>
</ol>

<p>对于较大浮点数应该使用BigDecimal来进行计算。
</p>
<p>
java虚拟机规范强调可移植性，对于在任何机器上来说相同的程序得到的结果应该是相同的。但是对于浮点计算的话，比如Intel CPU针对于浮点数计算所有中间结果都使用bit 80表示，而最后截取bit 64,造成和其他CPU计算结果不同。为了达到可移植性，java规范所有中间结果必须使用bit 64截断，但是遭反对，因此java提供了strictfp关键字标记某个方法，对于这个方法里面所有浮点数计算，所有中间结果使用64 bit截断，否则使用适合native方式计算。另外一些浮点数计算比如pow2,pow3,sqrt的话，一方面依赖于CPU浮点计算方式，另外一方面依赖于本身算法（如果CPU本身提供这种指令的话就可以使用CPU指令），也会造成不可移植性，比如Math.sqrt.如果希望在这方面也达到同样效果的话，可以使用StrictMath类，底层使用fdlibm，以确保所有平台上得到相同的结果。
</p>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> GC</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>Sun jdk 1.6 gc <a href="http://www.slideshare.net/BlueDavy/sun-jdk-16-gc">http://www.slideshare.net/BlueDavy/sun-jdk-16-gc</a>
</li>
<li>Java SE 6 HotSpot[tm] Virtual Machine Garbage Collection Tuning : <a href="http://www.oracle.com/technetwork/java/javase/gc-tuning-6-140523.html">http://www.oracle.com/technetwork/java/javase/gc-tuning-6-140523.html</a>
</li>
<li>Performance Tuning Garbage Collection in Java : <a href="http://www.petefreitag.com/articles/gctuning/">http://www.petefreitag.com/articles/gctuning/</a>
</li>
<li>java - Garbage Collection and Threads - Stack Overflow : <a href="http://stackoverflow.com/questions/2085544/garbage-collection-and-threads">http://stackoverflow.com/questions/2085544/garbage-collection-and-threads</a>
</li>
<li>JVM performance optimization
<ul>
<li>JVM performance optimization, Part 1: A JVM technology primer <a href="http://www.javaworld.com/javaworld/jw-08-2012/120821-jvm-performance-optimization-overview.html">http://www.javaworld.com/javaworld/jw-08-2012/120821-jvm-performance-optimization-overview.html</a>
</li>
<li>JVM performance optimization, Part 2: Compilers <a href="http://www.javaworld.com/javaworld/jw-09-2012/120905-jvm-performance-optimization-compilers.html">http://www.javaworld.com/javaworld/jw-09-2012/120905-jvm-performance-optimization-compilers.html</a>
</li>
<li>JVM performance optimization, Part 3: Garbage collection <a href="http://www.javaworld.com/javaworld/jw-10-2012/121010-jvm-performance-optimization-garbage-collection.html">http://www.javaworld.com/javaworld/jw-10-2012/121010-jvm-performance-optimization-garbage-collection.html</a>
</li>
<li>JVM performance optimization, Part 4: C4 garbage collection for low-latency Java applications <a href="http://www.javaworld.com/javaworld/jw-11-2012/121107-jvm-performance-optimization-low-latency-garbage-collection.html">http://www.javaworld.com/javaworld/jw-11-2012/121107-jvm-performance-optimization-low-latency-garbage-collection.html</a>
</li>
</ul>

</li>
<li>Understanding JVM Internals | CUBRID Blog <a href="http://www.cubrid.org/blog/dev-platform/understanding-jvm-internals">http://www.cubrid.org/blog/dev-platform/understanding-jvm-internals</a>
</li>
<li>The Principles of Java Application Performance Tuning | CUBRID Blog : <a href="http://www.cubrid.org/blog/dev-platform/the-principles-of-java-application-performance-tuning/">http://www.cubrid.org/blog/dev-platform/the-principles-of-java-application-performance-tuning/</a>
</li>
<li>Understanding JVM Internals, from Basic Structure to Java SE 7 Features | Architects Zone <a href="http://architects.dzone.com/articles/understanding-jvm-internals">http://architects.dzone.com/articles/understanding-jvm-internals</a>
</li>
</ul>


</div>
</div>
</div>
</div>

<!-- Baidu Analytics BEGIN --><script type="text/javascript">var _bdhmProtocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cscript src='" + _bdhmProtocol + "hm.baidu.com/h.js%3F54a700ad7035f6e485eaf2300641e7e9' type='text/javascript'%3E%3C/script%3E"));</script><!-- Baidu Analytics END --><!-- Google Analytics BEGIN --><script type="text/javascript">  var _gaq = _gaq || [];  _gaq.push(['_setAccount', 'UA-31377772-1']);  _gaq.push(['_trackPageview']);  (function() {    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);  })();</script><!-- Google Analytics END --><!-- Baidu Button BEGIN --><!-- <script type="text/javascript" id="bdshare_js" data="type=tools&amp;uid=6762177" ></script><script type="text/javascript" id="bdshell_js"></script><script type="text/javascript"> document.getElementById("bdshell_js").src = "http://bdimg.share.baidu.com/static/js/shell_v2.js?cdnversion=" + Math.ceil(new Date()/3600000)</script> --><!-- Baidu Button END --><!-- G+ BEGIN --><!-- Place this render call where appropriate --><script type="text/javascript">  (function() {    var po = document.createElement('script'); po.type = 'text/javascript'; po.async = true;    po.src = 'https://apis.google.com/js/plusone.js';    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(po, s);  })();</script><!-- G+ END --><!-- DISQUS BEGIN --><div id="disqus_thread"></div><script type="text/javascript">/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * *//* required: replace example with your forum shortname  */var disqus_shortname = 'dirlt';var disqus_identifier = 'jvm.html';var disqus_title = 'jvm.html';var disqus_url = 'http://dirlt.com/jvm.html';/* * * DON'T EDIT BELOW THIS LINE * * */(function() {var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);})();</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a><!-- DISQUS END --></body>
</html>
